# Румен иска да пребоядиса хола и за целта е наел майстори. Напишете програма, която изчислява разходите за ремонта, предвид следните цени:
#
# · Предпазен найлон - 1.50 лв. за кв. метър
#
# · Боя - 14.50 лв. за литър
#
# · Разредител за боя - 5.00 лв. за литър
#
# За всеки случай, към необходимите материали, Румен иска да добави още 10% от количеството боя и 2 кв.м. найлон, разбира се и 0.40 лв. за торбички. Сумата, която се заплаща на майсторите за 1 час работа, е равна на 30% от сбора на всички разходи за материали.
nylon = int(input())
paintLitres = int(input())
cleanerLitres = int(input())
hours = int(input())
