// Да се напише програма, която чете час и минути от 24-часово денонощие, въведени от потребителя и изчислява колко ще е часът след 15 минути.
// Резултатът да се отпечата във формат часове:минути. Часовете винаги са между 0 и 23, а минутите винаги са между 0 и 59. Часовете се изписват с една или две цифри.
// Минутите се изписват винаги с по две цифри, с водеща нула, когато е необходимо. 
int hours = int.Parse(Console.ReadLine());
int minutes = int.Parse(Console.ReadLine());

int time = minutes + 15;

if (time >= 60)
{
    hours += 1;
    time -= 60;
}

if (hours >= 24)
    hours -= 24;

if (time < 10)
    Console.WriteLine($"{hours}:0{time}");

else
    Console.WriteLine($"{hours}:{time}");