// Дадени са n цели числа в интервала [1…1000].
// От тях някакъв процент p1 са под 200, друг процент p2 са от 200 до 399, друг процент p3 са от 400 до 599, друг процент p4 са от 600 до 799 и останалите p5 процента са от 800 нагоре.
// Да се напише програма, която изчислява и отпечатва процентите p1, p2, p3, p4 и p5.
// Пример: имаме n = 20 числа: 53, 7, 56, 180, 450, 920, 12, 7, 150, 250, 680, 2, 600, 200, 800, 799, 199, 46, 128, 65. Получаваме следното разпределение и визуализация:
// Диапазон      Числа в диапазона                                   Брой числа      Процент
// < 200         53, 7, 56, 180, 12, 7, 150, 2, 199, 46, 128, 65     12	             p1 = 12 / 20 * 100 = 60.00%
// 200 … 399     250, 200	                                         2	             p2 = 2 / 20 * 100 = 10.00%
// 400 … 599     450	                                             1	             p3 = 1 / 20 * 100 = 5.00%
// 600 … 799     680, 600, 799	                                     3	             p4 = 3 / 20 * 100 = 15.00%
// ≥ 800         920, 800	                                         2	             p5 = 2 / 20 * 100 = 10.00%
int numbers = int.Parse(Console.ReadLine());

int c1 = 0, c2 = 0, c3 = 0, c4 = 0, c5 = 0;
for (int i = 0; i < numbers; i++)
{
    int number = int.Parse(Console.ReadLine());

    if (number < 200)
        c1++;
    else if (number < 400)
        c2++;
    else if (number < 600)
        c3++;
    else if (number < 800)
        c4++;
    else
        c5++;
}

double p1 = 100.0 * c1 / numbers;
double p2 = 100.0 * c2 / numbers;
double p3 = 100.0 * c3 / numbers;
double p4 = 100.0 * c4 / numbers;
double p5 = 100.0 * c5 / numbers;
Console.WriteLine($"{p1:f2}%");
Console.WriteLine($"{p2:f2}%");
Console.WriteLine($"{p3:f2}%");
Console.WriteLine($"{p4:f2}%");
Console.WriteLine($"{p5:f2}%");