// В града има тайна врата, за която всички знаят, но никой не е успявал да я отключи и да види какво има зад нея. За да бъде отключена трябва да се въведе трицифрен код.
// Напишете програма, която генерира комбинации спрямо въведени числа – предположения от потребителя. От конзолата се въвеждат три цифри.
// Тези цифри ще бъдат горната граница, до която ние искаме да получим всички трицифрени числа, на които всяка една цифра отговаря на следните условия:
// •	Цифрата на единиците и цифрата на стотиците трябва да бъде четна
// •	Цифрата на десетиците да бъде просто число в диапазона (2...7).
// Това ще са възможните комбинации според въведените предположения от потребителя, с които ще може евентуално да се отключи вратата.
int hundredsUpperLimit = int.Parse(Console.ReadLine());
int tensUpperLimit = int.Parse(Console.ReadLine());
int unitsUpperLimit = int.Parse(Console.ReadLine());

for (int hundreds = 2; hundreds <= hundredsUpperLimit; hundreds+=2)
{
    for (int tens = 2; tens <= tensUpperLimit; tens++)
    {
        if (tens == 2 || tens == 3 || tens == 5 || tens == 7)
        {
            for (int units = 2; units <= unitsUpperLimit; units += 2)
            {
                Console.WriteLine($"{hundreds} {tens} {units}");
            }
        }
    }
}