// Напишете програма, която чете цяло число n (1 ≤ n ≤ 100), въведено от потребителя, и печата диамант с размер n.
// Подсказки:
// •   Всички редове съдържат точно по n символа.
// •   Първият ред съдържа отляво и отдясно точно leftRight = (n - 1) / 2 тирета.
// •   Всеки следващ ред до средния съдържа отляво и отдясно с 1 тире по-малко от предходния.
// •   Всеки следващ ред след средния съдържа отляво и отдясно с 1 тире повече от предходния.
// •   Всеки ред съдържа в средата си (във вътрешността на диаманта) mid = n - 2 * leftRight - 2 тирета.
// •   Всеки ред съдържа 2 звездички, освен когато mid е отрицателно (тогава има само 1 звездичка).
// •   За всеки ред може да се изчислят и отпечатат неговите 5 съставни части:
//   o   leftRight тиренца отляво
//   o   1 звездичка
//   o   mid тиренца в средата (когато mid >= 0)
//   o   1 звездичка (когато mid >= 0)
//   o   1 звездичка
//   o   leftRight тиренца отляво
int number = int.Parse(Console.ReadLine());

if (number < 1 || number > 100)
    return;

for (int start = 0; start < number; start++)
{
    for (int leftRight = start; leftRight < (number - 1) / 2; leftRight++)
    {
        Console.Write("-");
    }
    for (int star = 1; star <= (start + 1) * 2 - 1; star++)
    {
        Console.Write("*");
        for (int mid = 0; mid < start; mid++)
        {
            Console.Write("-");
        }
    }
    for (int leftRight = start; leftRight < (number - 1) / 2; leftRight++)
    {
        Console.Write("-");
    }

    Console.WriteLine();
}
// Недовършено