// Любимият отбор на Пепи е на финал, но започва да губи мача. Треньорът на отбора не знае какви смени да направи, за да обърне резултата. 
// Напишете програма, с която ще разберете кой са първите 6 валидни смени, които могат да се направят.  
// Знаем, че всяка цифра от двата номера е в даден интервал:
// •	Първата цифра на първото число е в интервала от цифрата K до 8, включително.
// •	Втората цифра на първото число е в интервала от 9 до L, включително.
// •	Първата цифра на второто число е в интервала от цифрата M до 8, включително.
// •	Втората цифра на второто число е в интервала от 9 до N, включително.
// За да бъде възможна една смяна, първата цифра на всеки от номерата трябва да бъде четна, а втората -  нечетна.
// За да бъде валидна една смяна, то номерата НЕ трябва да съвпадат.
int digit1 = int.Parse(Console.ReadLine());
int digit2 = int.Parse(Console.ReadLine());
int digit3 = int.Parse(Console.ReadLine());
int digit4 = int.Parse(Console.ReadLine());

int count = 0;
for (int K = digit1; K <= 8; K++)
{
    for (int L = 9; L >= digit2; L--)
    {
        for (int M = digit3; M <= 8; M++)
        {
            for (int N = 9; N >= digit4; N--)
            {
                if (K % 2 != 0 || L % 2 == 0)
                    continue;
                if (M % 2 != 0 || N % 2 == 0)
                    continue;

                if (K == M && L == N)
                    Console.WriteLine("Cannot change the same player.");
                else
                {
                    Console.WriteLine($"{K}{L} - {M}{N}");
                    count++;
                }
                if (count == 6)
                    return;
            }
        }
    }
}