// Деси трябва да заведе котката си на ветеринар в клиниката "Happy Cat", но паркингът се заплаща.
// Напишете програма, която пресмята колко общо трябва да се плати за престоя на колата на Деси на паркинга, за да заведе котката си на ветеринар.
// Паркингът е различен от останалите и има разнообразен ценоразпис. За всеки четен ден и нечетен час, паркингът таксува 2.50 лева.
// Във всеки нечетен ден и четен час таксата е 1.25 лева, във всички останали случаи се заплаща 1 лев. Таксуването става на всеки изминал час от деня.
// Всеки един от изходите трябва да бъде закръглен до втория знак след десетичната запетая.
int days = int.Parse(Console.ReadLine());
int hoursForDay = int.Parse(Console.ReadLine());

double totalSum = 0;
for (int day = 1; day <= days; day++)
{
    double sum = 0;
    for (int hour = 1; hour <= hoursForDay; hour++)
    {
        if (day % 2 == 0 && hour % 2 != 0)
            sum += 2.50;
        else if (day % 2 != 0 && hour % 2 == 0)
            sum += 1.25;
        else
            sum += 1;
    }
    totalSum += sum;
    Console.WriteLine($"Day: {day} - {sum:f2} leva");
}
Console.WriteLine($"Total: {totalSum:f2} leva");