// Любо е голям почитател на киното и редовно ходи на прожекции и участва в томболи, от които често печели ваучери за кино.
// Вашата задача е да напишете програма, която да изчислява колко покупки от киното може да си купи Любо със спечеленият ваучер.
// Ако името на покупката съдържа повече от 8 символа, то тя е билет за филм, а нейната цена представлява сумата на ASCII символите от първите ѝ два символа.
// Ако името на покупката съдържа 8 или по-малко символа, нейната цена е равна на стойността на първия ASCII символ в името.
// Любо въвежда името на покупките, които желае, докато не въведе "End" или не въведе покупка, чиято стойност е по-голяма от останалата сума на ваучера. 
int voucher = int.Parse(Console.ReadLine());

string input = Console.ReadLine();
int ticket = 0, product = 0, sum = 0;
while (input != "End")
{
    if (input.Length > 8)
        sum = input[0] + input[1];
    else
        sum = input[0];

    if (voucher < sum)
        break;
    voucher -= sum;

    if (input.Length > 8)
        ticket++;
    else
        product++;
    input = Console.ReadLine();
}
Console.WriteLine(ticket);
Console.WriteLine(product);