// Поздравления, поради вашите задълбочени знания в сферата на програмирането МВР реши да наеме точно вас
// за създаването на новата им система за генериране на специални автомобилни номера. Всеки един специален автомобилен номер се състой от четири числа.
// Условията, които разграничават специалните от обикновените номера са следните: 
// •	Ако номерът започва с четна цифра, то той трябва да завършва на нечетна цифра и обратното – ако започва с нечетна, завършва на четна
// •	Първата цифра от номера е по-голяма от последната
// •	Сумата от втората и третата цифра трябва да е четно число
// Входа се състой от две числа - начало и край на интервал, между които трябва да се генерира всяко едно число от номера.
int start = int.Parse(Console.ReadLine());
int end = int.Parse(Console.ReadLine());

for (int i = start; i <= end; i++)
{
    for (int j = start; j <= end; j++)
    {
        for (int k = start; k <= end; k++)
        {
            for (int l = start; l <= end; l++)
            {
                if ((l % 2 == 0 && i % 2 == 0) || (l % 2 != 0 && i % 2 != 0))
                    continue;

                if (i > l && (k + j) % 2 == 0)
                {
                    Console.Write($"{i}{j}{k}{l} ");
                }
            }
        }
    }
}