// Да се напише програма, която прочита едно цяло число N и генерира всички възможни "щастливи" и различни 4-цифрени числа(всяка цифра от числото е в интервала [1...9]). 
// Числото трябва да отговаря на следните условия: 
// Щастливо число е 4-цифрено число, на което сбора от първите две цифри е равен на сбора от последните две.
// Числото N трябва да се дели без остатък от сбора на първите две цифри на "щастливото" число.
int luckyNumber = int.Parse(Console.ReadLine());

for (int i = 1; i <= 9; i++)
{
    for (int j = 1; j <= 9; j++)
    {
        for (int k = 1; k <= 9; k++)
        {
            for (int l = 1; l <= 9; l++)
            {
                if ((l + k) == (j + i) && luckyNumber % (l + k) == 0)
                    Console.Write($"{i}{j}{k}{l} ");
            }
        }
    }
}